# PaletteIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..PaletteIndex Property
FabricationServiceButton Class See Also
---
The palette index for this button.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public int PaletteIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PaletteIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int PaletteIndex {
	int get ();
}
```

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace